///////////////////////////////////////////////////////////////////////////////
//ARQUIVO:    SubrotinasCAN
//AUTOR:      Fábio Almeida
//CRIADO:     19/09/2024
//OBSERVAÇÕES:
////////////////////////////////////////////////////////////////////////////////
#include "main.h"
#include "global.h"
/*==============================================================================
PROTOCOLO CAN
==============================================================================*/
void protocoloCAN() {

	if(canRxBuffer[0] == 1) {
		flagMotorLigado = true;
		valorMotor = make16(canRxBuffer[1], canRxBuffer[2]);
		return;
	}

	flagMotorLigado = false;
	valorMotor = 0;

	enviaPacoteCAN();
}
/*==============================================================================
FIM DO ARQUIVO
==============================================================================*/
